app/controllers/posts_controller.rb

    def index
       @posts = Post.paginate(page: params[:page])
---
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 12], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

    def create
        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)  [["title", "The Surge"], ["content", "the surge is dead, long live the surge"], ["created_at", "2020-05-28 08:39:13.336853"], ["updated_at", "2020-05-28 08:39:13.336853"], ["name", "Alex"]]